[
  {
    "title": "Sales Executive",
    "companyName": "Kit POS Uganda Limited",
    "companyUrl": "https://www.brightermonday.co.ug/jobs?q=Kit%20POS%20Uganda%20Limited",
    "jobCategoryUrl": "https://www.brightermonday.co.ug/jobs/marketing-communications",
    "jobCategory": "Marketing & Communications",
    "location": "Kampala",
    "locationUrl": "https://www.brightermonday.co.ug/jobs/kampala",
    "jobType": "Full Time",
    "jobTypeUrl": "https://www.brightermonday.co.ug/jobs/full-time",
    "jobIndustryUrl": "https://www.brightermonday.co.ug/jobs/it-telecoms",
    "jobIndustry": "IT & Telecoms",
    "salary": "USh Commission Only Plus Commission",
    "minimumQualification": "Bachelors",
    "experienceLevel": "Executive level",
    "experienceLength": "3 years",
    "workingHours": "Full Time",
    "locationDetail": "Uganda (with potential for remote work)",
    "aboutUs": "Kit POS Uganda Limited is a leading provider of innovative Point of Sales solutions tailored for businesses in Uganda. Our flagship product, Numbers, is a cutting-edge cloud-based POS software...",
    "keyResponsibilities": [
      "Following up on leads",
      "Educating leads about our products",
      "Lead, mentor, and motivate a team of sales representatives to drive performance and meet sales objectives.",
      "Identify and cultivate relationships with key clients and partners to foster business growth and revenue opportunities.",
      "Conduct market research to identify trends, competitor activities, and customer needs to inform sales strategies.",
      "Collaborate with marketing and product development teams to enhance product offerings and address customer feedback.",
      "Monitor and analyze sales performance metrics to track progress and optimize sales strategies.",
      "Represent the company at industry events, conferences, and networking opportunities to promote brand awareness and generate leads."
    ],
    "requirements": [
      "A smart phone and/or laptop",
      "Proven track record of success in software sales, preferably in the POS or technology industry.",
      "Strong leadership and team management skills with the ability to inspire and motivate others.",
      "Excellent communication, negotiation, and presentation abilities.",
      "Deep understanding of the Ugandan market landscape, with existing networks and relationships a plus.",
      "Familiarity with cloud-based software solutions and understanding of technical concepts.",
      "Ability to thrive in a fast-paced, entrepreneurial environment and adapt to changing priorities.",
      "Valid driver's license and willingness to travel as needed."
    ],
    "whatWeOffer": [
      "Competitive salary and bonus system to reward your hard work and dedication.",
      "Opportunities for professional and personal development and advancement, with the chance to collaborate closely with Kit founders who are leaders in the industry.",
      "Access to a network of high-achieving members within the company, fostering a culture of collaboration and growth."
    ],
    "remoteWork": "This position offers the flexibility of remote work, enabling you to contribute to our innovative team from anywhere in Uganda. We believe in empowering our employees to achieve work-life balance while making meaningful contributions to our mission.",
    "howToApply": "Interested candidates should submit their resume/CV along with a cover letter detailing their relevant experience and why they are the ideal candidate for this position through Brightermonday Portal by clicking on the 'Apply Now' section.",
    "applyPageUrl": "https://www.brightermonday.co.ug/jobs?q=Kit%20POS%20Uganda%20Limited"
  },
  {
    "title": "Senior Backend Developer",
    "companyName": "Tech Solutions Uganda",
    "companyUrl": "https://www.brightermonday.co.ug/jobs?q=Tech%20Solutions%20Uganda",
    "jobCategoryUrl": "https://www.brightermonday.co.ug/jobs/it-software-data",
    "jobCategory": "IT, Software & Data",
    "location": "Kampala",
    "locationUrl": "https://www.brightermonday.co.ug/jobs/kampala",
    "jobType": "Full Time",
    "jobTypeUrl": "https://www.brightermonday.co.ug/jobs/full-time",
    "jobIndustryUrl": "https://www.brightermonday.co.ug/jobs/software-development",
    "jobIndustry": "Software Development",
    "salary": "USh 6,000,000 - 9,000,000 per month",
    "minimumQualification": "Bachelors in Computer Science or related field",
    "experienceLevel": "Senior level",
    "experienceLength": "5 years",
    "workingHours": "Full Time",
    "locationDetail": "Uganda (onsite preferred)",
    "aboutUs": "Tech Solutions Uganda is a top tech company providing cutting-edge software products and services designed to innovate the Ugandan market and beyond.",
    "keyResponsibilities": [
      "Designing, developing and maintaining backend services.",
      "Building APIs and integrating with third party services.",
      "Collaborating with frontend developers to integrate user-facing elements with server side logic.",
      "Optimizing applications for performance and scalability.",
      "Ensuring code quality, testing, and deployment processes are followed."
    ],
    "requirements": [
      "Proficiency in Python and frameworks like Django and Flask.",
      "Strong knowledge of AI and machine learning concepts.",
      "Experience with database systems like PostgreSQL, MySQL.",
      "Ability to write clean, maintainable and efficient code.",
      "Excellent problem-solving skills and team collaboration."
    ],
    "whatWeOffer": [
      "Competitive salary and benefits package.",
      "Continuous professional development opportunities.",
      "A friendly and innovative working environment."
    ],
    "remoteWork": "Partial remote work allowed with flexible working hours.",
    "howToApply": "Submit your application through the Brightermonday portal with your resume and cover letter.",
    "applyPageUrl": "https://www.brightermonday.co.ug/jobs?q=Tech%20Solutions%20Uganda"
  }
]

